tools-for-mongodb/go/mongodb-profile-for-pt-query-digest.org
* Context

Work on this started after some casual conversation with [[http://github.com/Lowercases][Nacho Nin]], specifically me asking a question about [[https://vividcortex.com/resources/network-analyzer-for-mongodb/][this]].

I thought this paragraph: 

        You can use standard log analysis tools such as Percona Toolkit's pt-query-digest to analyze the output and build insight into queries and server performance.

must have been some copy and paste error, that they started publishing the tool for MySQL, and just copied that text to the web pages for other systems like mongodb and redis. Turns out I was wrong, and pt-query-digest works, not just for SQL, but for just about everything, including mongodb 'queries'. I did a quick test to verify this and it was right. This meant that, in order to use pt-query-digest with mongodb/tokumx, just a couple of things were needed: 

- having a log format that pt-query-digest recognizes, with mongodb performance data, and
- getting a new fingerprint() function to generate the query summary in the report ranking (this is the code that summarizes something like 'select a, b, c from t where a = x' into 'select t', to give you a quick overview of a query in the ranking. 

The second option I left to [[https://github.com/frank-cizmich][Frank]], and for the first one, I decided it would be easier to generate a fake slow query log format (emulating the idea discussed with Nacho) and use that with pt-query-digest. 

* The target format

Here is an example entry of this hybrid slow query log I want to generate: 

#+BEGIN_EXAMPLE
# Time: 150622 16:08:58
# User@Host:  @ 127.0.0.1 []
# Thread_id: 1 Schema: Last_errno: 0 Killed: 0
# Query_time: 0 Lock_time: 0 Rows_sent: 6 Rows_examined: 6 Rows_affected: 0 Rows_read: 1
# Bytes_sent: n/a
SET timestamp=1435000138;
examples.presentations.find{};
#+END_EXAMPLE 

Mongodb does not have queries in the same sense as MySQL or any other SQL based database has. All interactions with the database are made via commands or operations. A query is one specific kind of operation, and the projections and restrictions from SQL statements that we aggregate with pt-query-digest are found in json documents in mongodb's case. The document may be empty/absent, as in the case of a full collection scan. 

What is seen as 

   SELECT * FROM table

in SQL, is seen as just 

   {op: "query", ns:"table"}

in mongodb. 

Initially, there are two ways to obtain this information from mongodb. One is via network traffic captures, and the other one is via the [[http://docs.mongodb.org/manual/reference/database-profiler/][database profiler]]. The latter is enabled per-database, which means there is no mongodb analogue to MySQL's slow query log at a global level. 

I tried both approachs and will be describing each on this document.  

You'll notice the function used to recurse a json structure and the one to get the slow query log entry header are slightly different in each case, and that's because the mongodb profiler naturally provides a lot more performance related data than what can be obtained by capturing traffic. 

The code is not very clean (or pretty) at this stage, but this is just intended as a proof of concept, and as a guide for someone who may want to implement this professionally (i.e. with test cases and such). 

* The MongoDB profiler 

Here's the basics you need to know to get started using this. As I said before, the profiler is enabled per database. So, to enable it for the examples database, you would do the following: 

#+BEGIN_SRC js
use examples
db.setProfilingLevel(2)
#+END_SRC

There are three profiling levels: 
  0 - Profiler is off
  1 - Profiler is on for slow operations. 'Slow' is defined as taking more than [[http://docs.mongodb.org/manual/reference/configuration-options/#operationProfiling.slowOpThresholdMs][slowOpThresholdMs]] milliseconds. 
  2 - Profiler is on for all operations. 

Once enabled, you can look at profiler events by querying the system.profile collection for the selected database. Here's a sample document from a test system: 

#+BEGIN_EXAMPLE
> db.system.profile.find({op:"getmore"}).limit(1).pretty()
{
	"op" : "getmore",
	"ns" : "examples.system.profile",
	"cursorid" : 74041478549,
	"ntoreturn" : 0,
	"keyUpdates" : 0,
	"numYield" : 0,
	"lockStats" : {
		"timeLockedMicros" : {
			"r" : NumberLong(45),
			"w" : NumberLong(0)
		},
		"timeAcquiringMicros" : {
			"r" : NumberLong(2),
			"w" : NumberLong(2)
		}
	},
	"nreturned" : 11,
	"responseLength" : 6924,
	"millis" : 0,
	"execStats" : {

	},
	"ts" : ISODate("2015-06-22T03:56:10.776Z"),
	"client" : "127.0.0.1",
	"allUsers" : [ ],
	"user" : ""
}
#+END_EXAMPLE

As you can imaging, turning this into a mysql-style slow query log is just a matter of: 
  - Processing the json
  - Identifying and saving relevant variables depending on the operation type (i.e. "ntoreturn" in this case of a "getmore" operation)
  - Generating a slow query log entry for each profile collection entry, filling in the headers with the info obtained from the profile document. 

* Preface to the code

I chose Go for this as, in my experience, for something like this, it generates code that's almost as, if not as fast as what C would generate, and it provides some facilities for faster prototyping/iteration. As stated before, the code is not pretty. Some of it may be Go itself (lots of boilerplate code cannot be abstracted away in a way that could be done in, say, ruby or lisp), but most of it is probably due to my inexperience with the language. 

Since this is a test, I'm going to put it all on a single file on the main package: 

#+HEADERS: :tangle mongop2mysqlslow.go 
#+BEGIN_SRC go
package main
#+END_SRC

Imported packages: 
  - fmt: to print to stdout
  - mgo and mgo/bson: to connect to and send operations and commands to mongo
  - time is used when generating the slow query log header entry 

#+HEADERS: :tangle mongop2mysqlslow.go
#+BEGIN_SRC go 
import (
	"fmt"
	"labix.org/v2/mgo"
	"labix.org/v2/mgo/bson"
	"time"
)
#+END_SRC

The OpInfo type is used to save significant variables found in the json for each profile document. This includes, but is not limited to, user name, client IP address, Returned bytes, etc. 

#+HEADERS: :tangle mongop2mysqlslow.go
#+BEGIN_SRC go
type OpInfo map[string]string
#+END_SRC

