tools-for-mongodb/go/mongodb-profile-for-pt-query-digest.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>mongodb-profile-for-pt-query-digest</title>
<!-- 2015-06-23 Tue 16:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Fernando Ipar" />
</head>
<body>
<div id="content">
<h1 class="title">mongodb-profile-for-pt-query-digest</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Context</a></li>
<li><a href="#sec-2">2. The target format</a></li>
<li><a href="#sec-3">3. The MongoDB profiler</a></li>
<li><a href="#sec-4">4. Preface to the code</a></li>
<li><a href="#sec-5">5. The document processing bits</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Context</h2>
<div class="outline-text-2" id="text-1">
<p>
Work on this started after some casual conversation with <a href="http://github.com/Lowercases">Nacho Nin</a>, specifically me asking a question about <a href="https://vividcortex.com/resources/network-analyzer-for-mongodb/">this</a>.
</p>

<p>
I thought this paragraph: 
</p>

<blockquote>
<p>
You can use standard log analysis tools such as Percona Toolkit's pt-query-digest to analyze the output and build insight into queries and server performance.
</p>
</blockquote>

<p>
must have been some copy and paste error, that they started publishing the tool for MySQL, and just copied that text to the web pages for other systems like mongodb and redis. Turns out I was wrong, and pt-query-digest works, not just for SQL, but for just about everything, including mongodb 'queries'. I did a quick test to verify this and it was right. This meant that, in order to use pt-query-digest with mongodb/tokumx, just a couple of things were needed: 
</p>

<ul class="org-ul">
<li>having a log format that pt-query-digest recognizes, with mongodb performance data, and
</li>
<li>getting a new fingerprint() function to generate the query summary in the report ranking (this is the code that summarizes something like 'select a, b, c from t where a = x' into 'select t', to give you a quick overview of a query in the ranking. 
</li>
</ul>

<p>
The second option I left to <a href="https://github.com/frank-cizmich">Frank</a>, and for the first one, I decided it would be easier to generate a fake slow query log format (emulating the idea discussed with Nacho) and use that with pt-query-digest. 
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The target format</h2>
<div class="outline-text-2" id="text-2">
<p>
Here is an example entry of this hybrid slow query log I want to generate: 
</p>

<pre class="example">
# Time: 150622 16:08:58
# User@Host:  @ 127.0.0.1 []
# Thread_id: 1 Schema: Last_errno: 0 Killed: 0
# Query_time: 0 Lock_time: 0 Rows_sent: 6 Rows_examined: 6 Rows_affected: 0 Rows_read: 1
# Bytes_sent: n/a
SET timestamp=1435000138;
examples.presentations.find{};
</pre>

<p>
Mongodb does not have queries in the same sense as MySQL or any other SQL based database has. All interactions with the database are made via commands or operations. A query is one specific kind of operation, and the projections and restrictions from SQL statements that we aggregate with pt-query-digest are found in json documents in mongodb's case. The document may be empty/absent, as in the case of a full collection scan. 
</p>

<p>
What is seen as 
</p>

<p>
SELECT * FROM table
</p>

<p>
in SQL, is seen as just 
</p>

<p>
{op: "query", ns:"table"}
</p>

<p>
in mongodb. 
</p>

<p>
Initially, there are two ways to obtain this information from mongodb. One is via network traffic captures, and the other one is via the <a href="http://docs.mongodb.org/manual/reference/database-profiler/">database profiler</a>. The latter is enabled per-database, which means there is no mongodb analogue to MySQL's slow query log at a global level. 
</p>

<p>
I tried both approachs and will be describing each on this document.  
</p>

<p>
You'll notice the function used to recurse a json structure and the one to get the slow query log entry header are slightly different in each case, and that's because the mongodb profiler naturally provides a lot more performance related data than what can be obtained by capturing traffic. 
</p>

<p>
The code is not very clean (or pretty) at this stage, but this is just intended as a proof of concept, and as a guide for someone who may want to implement this professionally (i.e. with test cases and such). 
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> The MongoDB profiler</h2>
<div class="outline-text-2" id="text-3">
<p>
Here's the basics you need to know to get started using this. As I said before, the profiler is enabled per database. So, to enable it for the examples database, you would do the following: 
</p>

<div class="org-src-container">

<pre class="src src-js">use examples
db.setProfilingLevel(2)
</pre>
</div>

<p>
There are three profiling levels: 
  0 - Profiler is off
  1 - Profiler is on for slow operations. 'Slow' is defined as taking more than <a href="http://docs.mongodb.org/manual/reference/configuration-options/#operationProfiling.slowOpThresholdMs">slowOpThresholdMs</a> milliseconds. 
  2 - Profiler is on for all operations. 
</p>

<p>
Once enabled, you can look at profiler events by querying the system.profile collection for the selected database. Here's a sample document from a test system: 
</p>

<pre class="example">
&gt; db.system.profile.find({op:"getmore"}).limit(1).pretty()
{
	"op" : "getmore",
	"ns" : "examples.system.profile",
	"cursorid" : 74041478549,
	"ntoreturn" : 0,
	"keyUpdates" : 0,
	"numYield" : 0,
	"lockStats" : {
		"timeLockedMicros" : {
			"r" : NumberLong(45),
			"w" : NumberLong(0)
		},
		"timeAcquiringMicros" : {
			"r" : NumberLong(2),
			"w" : NumberLong(2)
		}
	},
	"nreturned" : 11,
	"responseLength" : 6924,
	"millis" : 0,
	"execStats" : {

	},
	"ts" : ISODate("2015-06-22T03:56:10.776Z"),
	"client" : "127.0.0.1",
	"allUsers" : [ ],
	"user" : ""
}
</pre>

<p>
As you can imagine, turning this into a mysql-style slow query log is just a matter of: 
</p>
<ul class="org-ul">
<li>Processing the json
</li>
<li>Identifying and saving relevant variables depending on the operation type (i.e. "ntoreturn" in this case of a "getmore" operation)
</li>
<li>Generating a slow query log entry for each profile collection entry, filling in the headers with the info obtained from the profile document. 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Preface to the code</h2>
<div class="outline-text-2" id="text-4">
<p>
I chose Go for this as, in my experience, for something like this, it generates code that's almost as, if not as fast as what C would generate, and it provides some facilities for faster prototyping/iteration. As stated before, the code is not pretty. Some of it may be Go itself (lots of boilerplate code cannot be abstracted away in a way that could be done in, say, ruby or lisp), but most of it is probably due to my inexperience with the language. 
</p>

<p>
Since this is a test, I'm going to put it all on a single file on the main package: 
</p>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #F0DFAF; font-weight: bold;">package</span> main
</pre>
</div>

<p>
Imported packages: 
</p>
<ul class="org-ul">
<li>fmt: to print to stdout
</li>
<li>mgo and mgo/bson: to connect to and send operations and commands to mongo
</li>
<li>time is used when generating the slow query log header entry 
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #F0DFAF; font-weight: bold;">import</span> (
        <span style="color: #CC9393;">"fmt"</span>
        <span style="color: #CC9393;">"labix.org/v2/mgo"</span>
        <span style="color: #CC9393;">"labix.org/v2/mgo/bson"</span>
        <span style="color: #CC9393;">"time"</span>
)
</pre>
</div>

<p>
The OpInfo type is used to save significant variables found in the json for each profile document. This includes, but is not limited to, user name, client IP address, Returned bytes, etc. 
</p>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #F0DFAF; font-weight: bold;">type</span> <span style="color: #7CB8BB;">OpInfo</span> <span style="color: #F0DFAF; font-weight: bold;">map</span>[<span style="color: #7CB8BB;">string</span>]<span style="color: #7CB8BB;">string</span>
</pre>
</div>
</div>
</div>
