tools-for-mongodb/go/mongodb-profile-for-pt-query-digest.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> The document processing bits</h2>
<div class="outline-text-2" id="text-5">
<p>
Each system.profile entry will have most of the info we need to generate a good slow query log entry for use with pt-query-digest. For that, we need some aux functions to help us properly process json. 
</p>

<p>
Sometimes we'll be processing an entry and find some subdocument to process. While processing it, we could end up with another OpInfo map, and in those cases, we'll have to merge them: 
</p>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #F0DFAF; font-weight: bold;">func</span> <span style="color: #93E0E3;">mergeOpInfoMaps</span>(s1 OpInfo, s2 OpInfo) (result OpInfo) {
        result = <span style="color: #DCDCCC; font-weight: bold;">make</span>(<span style="color: #7CB8BB;">OpInfo</span>)
        <span style="color: #F0DFAF; font-weight: bold;">for</span> k, v := <span style="color: #F0DFAF; font-weight: bold;">range</span> s1 {
                <span style="color: #F0DFAF; font-weight: bold;">if</span> v2, ok := s2[v]; ok {
                        result[k] = fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"%v | %v"</span>, v, v2)
                } <span style="color: #F0DFAF; font-weight: bold;">else</span> {
                        result[k] = v
                }
        }
        <span style="color: #F0DFAF; font-weight: bold;">return</span> result
}
</pre>
</div>

<p>
We process json maps recursively. We have a json map for every document in the profile collection, and we need to process recursively as some of it's elements may be maps themselves. 
</p>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #F0DFAF; font-weight: bold;">func</span> <span style="color: #93E0E3;">recurseJsonMap</span>(json <span style="color: #F0DFAF; font-weight: bold;">map</span>[<span style="color: #7CB8BB;">string</span>]<span style="color: #F0DFAF; font-weight: bold;">interface</span>{}) (output string, query string, info OpInfo) {
        i := 0
        info = <span style="color: #DCDCCC; font-weight: bold;">make</span>(<span style="color: #7CB8BB;">OpInfo</span>)
        <span style="color: #F0DFAF; font-weight: bold;">for</span> k, v := <span style="color: #F0DFAF; font-weight: bold;">range</span> json {
                <span style="color: #F0DFAF; font-weight: bold;">if</span> k == <span style="color: #CC9393;">"user"</span> || k == <span style="color: #CC9393;">"ns"</span> || k == <span style="color: #CC9393;">"millis"</span> || k == <span style="color: #CC9393;">"responseLength"</span> || k == <span style="color: #CC9393;">"client"</span> || k == <span style="color: #CC9393;">"nscanned"</span> || k == <span style="color: #CC9393;">"ntoreturn"</span> || k == <span style="color: #CC9393;">"ntoskip"</span> || k == <span style="color: #CC9393;">"nreturned"</span> || k == <span style="color: #CC9393;">"op"</span> || k == <span style="color: #CC9393;">"ninserted"</span> || k == <span style="color: #CC9393;">"ndeleted"</span> || k == <span style="color: #CC9393;">"nModified"</span> || k == <span style="color: #CC9393;">"cursorid"</span> {
                        info[k] = fmt.<span style="color: #93E0E3;">Sprint</span>(v)
                }
                <span style="color: #F0DFAF; font-weight: bold;">if</span> k == <span style="color: #CC9393;">"query"</span> {
                        query, _, _ = <span style="color: #93E0E3;">recurseJsonMap</span>(v.(<span style="color: #F0DFAF; font-weight: bold;">map</span>[<span style="color: #7CB8BB;">string</span>]<span style="color: #F0DFAF; font-weight: bold;">interface</span>{}))
                }
                <span style="color: #F0DFAF; font-weight: bold;">if</span> k ==<span style="color: #CC9393;">"updateobj"</span> {
                        updateobj, _, _ := <span style="color: #93E0E3;">recurseJsonMap</span>(v.(<span style="color: #F0DFAF; font-weight: bold;">map</span>[<span style="color: #7CB8BB;">string</span>]<span style="color: #F0DFAF; font-weight: bold;">interface</span>{}))
                        info[k] = updateobj
                }
                <span style="color: #F0DFAF; font-weight: bold;">if</span> k == <span style="color: #CC9393;">"command"</span> {
                        command, _, _ := <span style="color: #93E0E3;">recurseJsonMap</span>(v.(<span style="color: #F0DFAF; font-weight: bold;">map</span>[<span style="color: #7CB8BB;">string</span>]<span style="color: #F0DFAF; font-weight: bold;">interface</span>{}))
                        info[k] = command
                }
                i++
                comma := <span style="color: #CC9393;">", "</span>
                <span style="color: #F0DFAF; font-weight: bold;">if</span> i == <span style="color: #DCDCCC; font-weight: bold;">len</span>(json) {
                        comma = <span style="color: #CC9393;">""</span>
                }
                <span style="color: #F0DFAF; font-weight: bold;">switch</span> extracted_v := v.(<span style="color: #F0DFAF; font-weight: bold;">type</span>) {
                <span style="color: #F0DFAF; font-weight: bold;">case</span> string, time.Time, int, int32, int64:
                        output += fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"%v:%v%v"</span>, k, extracted_v, comma)
                <span style="color: #F0DFAF; font-weight: bold;">case</span> float64:
                        output += fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"%v:%v%v"</span>, k, <span style="color: #93E0E3;">float64</span>(extracted_v), comma)
                <span style="color: #F0DFAF; font-weight: bold;">case</span> <span style="color: #F0DFAF; font-weight: bold;">map</span>[<span style="color: #7CB8BB;">string</span>]<span style="color: #F0DFAF; font-weight: bold;">interface</span>{}:
                        auxstr, _query, auxOpInfo := <span style="color: #93E0E3;">recurseJsonMap</span>(extracted_v)
                        <span style="color: #F0DFAF; font-weight: bold;">if</span> _query != <span style="color: #CC9393;">""</span> {
                                query = _query
                        }
                        info = <span style="color: #93E0E3;">mergeOpInfoMaps</span>(info, auxOpInfo)
                        output += fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"%v:{%v}%v"</span>, k, auxstr, comma)
                <span style="color: #F0DFAF; font-weight: bold;">case</span> []<span style="color: #F0DFAF; font-weight: bold;">interface</span>{}:
                        output += fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"%v:%v%v"</span>, k, <span style="color: #93E0E3;">recurseArray</span>(extracted_v), comma)
                <span style="color: #F0DFAF; font-weight: bold;">case</span> bson.ObjectId: 
                        output += fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"%v:%v%v"</span>, k, extracted_v.<span style="color: #93E0E3;">String</span>(), comma)
                <span style="color: #F0DFAF; font-weight: bold;">default</span>:
                        output += fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"%v:%T%v"</span>, k, extracted_v, comma)
                }

        }
        <span style="color: #F0DFAF; font-weight: bold;">return</span> output, query, info
}
</pre>
</div>

<p>
Among the possible elements of the map are arrays, which must also be processed recursively, as each element may be itself an array (or a json document). 
</p>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #F0DFAF; font-weight: bold;">func</span> <span style="color: #93E0E3;">recurseArray</span>(input []<span style="color: #F0DFAF; font-weight: bold;">interface</span>{}) (output string) {
        output = <span style="color: #CC9393;">"["</span>
        i := 0
        <span style="color: #F0DFAF; font-weight: bold;">for</span> k, v := <span style="color: #F0DFAF; font-weight: bold;">range</span> input {
                i++
                comma := <span style="color: #CC9393;">", "</span>
                <span style="color: #F0DFAF; font-weight: bold;">if</span> i == <span style="color: #DCDCCC; font-weight: bold;">len</span>(input) {
                        comma = <span style="color: #CC9393;">""</span>
                }
                <span style="color: #F0DFAF; font-weight: bold;">switch</span> extracted_v := v.(<span style="color: #F0DFAF; font-weight: bold;">type</span>) {
                <span style="color: #F0DFAF; font-weight: bold;">case</span> <span style="color: #F0DFAF; font-weight: bold;">map</span>[<span style="color: #7CB8BB;">string</span>]<span style="color: #F0DFAF; font-weight: bold;">interface</span>{}:
                        aux, _, _ := <span style="color: #93E0E3;">recurseJsonMap</span>(extracted_v)
                        output += fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"%v:{%v}%v"</span>, k, aux, comma)
                <span style="color: #F0DFAF; font-weight: bold;">case</span> []<span style="color: #F0DFAF; font-weight: bold;">interface</span>{}:
                        output += fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"%v:%v%v"</span>, k, <span style="color: #93E0E3;">recurseArray</span>(extracted_v), comma)
                <span style="color: #F0DFAF; font-weight: bold;">default</span>:
                        output += fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"%v:%v%v"</span>, k, extracted_v, comma)
                }
        }
        output += fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"]"</span>)
        <span style="color: #F0DFAF; font-weight: bold;">return</span> output
}
</pre>
</div>

<p>
Generating the header for each slow query log entry is just a matter of filling in the blanks with the data we have in the OpInfo array built for each document processed. 
</p>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #F0DFAF; font-weight: bold;">func</span> <span style="color: #93E0E3;">getSlowQueryLogHeader</span>(input OpInfo) (output string) {

        millis, sent, user, host, inserted, scanned, deleted, returned := <span style="color: #93E0E3;">initSlowQueryLogHeaderVars</span>(input)
        affected := inserted
        <span style="color: #F0DFAF; font-weight: bold;">if</span> input[<span style="color: #CC9393;">"op"</span>] == <span style="color: #CC9393;">"remove"</span> {
                affected = deleted
        }
        now := time.<span style="color: #93E0E3;">Now</span>().<span style="color: #93E0E3;">Format</span>(<span style="color: #CC9393;">"060102 15:04:05"</span>)
        output = fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"# Time: %v\n"</span>, now)
        output += fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"# User@Host: %v @ %v []\n"</span>, user, host)
        output += <span style="color: #CC9393;">"# Thread_id: 1 Schema: Last_errno: 0 Killed: 0\n"</span>
        output += fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"# Query_time: %v Lock_time: 0 Rows_sent: %v Rows_examined: %v Rows_affected: %v Rows_read: 1\n"</span>, millis, returned, scanned, affected)
        output += fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"# Bytes_sent: %v\n"</span>, sent)
        output += fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"SET timestamp=%v;\n"</span>, time.<span style="color: #93E0E3;">Now</span>().<span style="color: #93E0E3;">Unix</span>())
        <span style="color: #F0DFAF; font-weight: bold;">return</span> output
}
</pre>
</div>

<p>
The reason I moved the initialization with default values of variables that may be missing from the OpInfo map, is that the go way to do this (that I know of) has a lot of repeated code, and I wanted to move that away from the function that generates the header. 
</p>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #F0DFAF; font-weight: bold;">func</span> <span style="color: #93E0E3;">initSlowQueryLogHeaderVars</span>(input OpInfo) (millis string, sent string, user string, host string, inserted string, scanned string, deleted string, returned string) {
        millis = <span style="color: #CC9393;">"n/a"</span>
        sent = <span style="color: #CC9393;">"n/a"</span>
        user = <span style="color: #CC9393;">""</span>
        host = <span style="color: #CC9393;">""</span>
        inserted = <span style="color: #CC9393;">"0"</span>
        scanned = <span style="color: #CC9393;">"0"</span>
        deleted = <span style="color: #CC9393;">"0"</span>
        returned = <span style="color: #CC9393;">"0"</span>
        <span style="color: #F0DFAF; font-weight: bold;">if</span> v, ok := input[<span style="color: #CC9393;">"millis"</span>]; ok {
                millis = v
        }
        <span style="color: #F0DFAF; font-weight: bold;">if</span> v, ok := input[<span style="color: #CC9393;">"sent"</span>]; ok {
                sent = v
        }
        <span style="color: #F0DFAF; font-weight: bold;">if</span> v, ok := input[<span style="color: #CC9393;">"user"</span>]; ok {
                user = v
        }
        <span style="color: #F0DFAF; font-weight: bold;">if</span> v, ok := input[<span style="color: #CC9393;">"client"</span>]; ok {
                host = v
        }
        <span style="color: #F0DFAF; font-weight: bold;">if</span> v, ok := input[<span style="color: #CC9393;">"ninserted"</span>]; ok {
                inserted = v
        }
        <span style="color: #F0DFAF; font-weight: bold;">if</span> v, ok := input[<span style="color: #CC9393;">"nscanned"</span>]; ok {
                scanned = v
        }
        <span style="color: #F0DFAF; font-weight: bold;">if</span> v, ok := input[<span style="color: #CC9393;">"ndeleted"</span>]; ok {
                deleted = v
        }
        <span style="color: #F0DFAF; font-weight: bold;">if</span> v, ok := input[<span style="color: #CC9393;">"nreturned"</span>]; ok {
                returned = v
        }
        <span style="color: #F0DFAF; font-weight: bold;">return</span> millis, sent, user, host, inserted, scanned, deleted, returned
}
</pre>
</div>

<p>
We're now ready for main, which basically iterates over the profile collection, and processes each document found. 
Note that this is currently hardcoded to: 
</p>
<ul class="org-ul">
<li>Connect to mongo on 127.0.0.1 on the default port (27017)
</li>
<li>Look for the system.profile collection in the examples database
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #F0DFAF; font-weight: bold;">func</span> <span style="color: #93E0E3;">main</span>() {
        session, err := mgo.<span style="color: #93E0E3;">Dial</span>(<span style="color: #CC9393;">"127.0.0.1"</span>)
        <span style="color: #F0DFAF; font-weight: bold;">if</span> err != <span style="color: #BFEBBF;">nil</span> {
                <span style="color: #DCDCCC; font-weight: bold;">panic</span>(err)
        }
        <span style="color: #F0DFAF; font-weight: bold;">defer</span> session.<span style="color: #93E0E3;">Close</span>()
        col := session.<span style="color: #93E0E3;">DB</span>(<span style="color: #CC9393;">"examples"</span>).<span style="color: #93E0E3;">C</span>(<span style="color: #CC9393;">"system.profile"</span>)

        <span style="color: #F0DFAF; font-weight: bold;">var</span> results []<span style="color: #F0DFAF; font-weight: bold;">map</span>[<span style="color: #7CB8BB;">string</span>]<span style="color: #F0DFAF; font-weight: bold;">interface</span>{}
        err = col.<span style="color: #93E0E3;">Find</span>(bson.<span style="color: #7CB8BB;">M</span>{}).<span style="color: #93E0E3;">All</span>(&amp;results)

        <span style="color: #F0DFAF; font-weight: bold;">if</span> err != <span style="color: #BFEBBF;">nil</span> {
                <span style="color: #DCDCCC; font-weight: bold;">panic</span>(err)
        }

        <span style="color: #F0DFAF; font-weight: bold;">for</span> _, v := <span style="color: #F0DFAF; font-weight: bold;">range</span> results {
                <span style="color: #F0DFAF; font-weight: bold;">var</span> info OpInfo = <span style="color: #DCDCCC; font-weight: bold;">make</span>(<span style="color: #7CB8BB;">OpInfo</span>)
                _, _query, info := <span style="color: #93E0E3;">recurseJsonMap</span>(v)
                query := <span style="color: #CC9393;">""</span>
                <span style="color: #F0DFAF; font-weight: bold;">if</span> v, ok := info[<span style="color: #CC9393;">"op"</span>]; ok {
                        ns := info[<span style="color: #CC9393;">"ns"</span>] <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">ns is always there or we must just crash/behave erratically </span>
                        <span style="color: #F0DFAF; font-weight: bold;">switch</span> v {
                        <span style="color: #F0DFAF; font-weight: bold;">case</span> <span style="color: #CC9393;">"query"</span>:
                                limit := info[<span style="color: #CC9393;">"ntoreturn"</span>]
                                skip := info[<span style="color: #CC9393;">"ntoskip"</span>]
                                <span style="color: #F0DFAF; font-weight: bold;">if</span> limit == <span style="color: #CC9393;">"0"</span> {
                                        limit = <span style="color: #CC9393;">""</span>
                                } <span style="color: #F0DFAF; font-weight: bold;">else</span> {
                                        limit = fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">".limit(%v)"</span>, limit)
                                }
                                <span style="color: #F0DFAF; font-weight: bold;">if</span> skip == <span style="color: #CC9393;">"0"</span> {
                                        skip = <span style="color: #CC9393;">""</span>
                                } <span style="color: #F0DFAF; font-weight: bold;">else</span> {
                                        skip = fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">".skip(%v)"</span>, skip)
                                }
                                query = fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"%v.find{%v}%v%v;"</span>, ns, _query, skip, limit)
                        <span style="color: #F0DFAF; font-weight: bold;">case</span> <span style="color: #CC9393;">"insert"</span>:
                                query = fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"%v.insert{%v}"</span>,ns, _query)
                        <span style="color: #F0DFAF; font-weight: bold;">case</span> <span style="color: #CC9393;">"update"</span>:
                                query = fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"%v.update({%v},{%v})"</span>, ns, _query, info[<span style="color: #CC9393;">"updateobj"</span>])
                        <span style="color: #F0DFAF; font-weight: bold;">case</span> <span style="color: #CC9393;">"remove"</span>:
                                query = fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"%v.remove({%v})"</span>, ns, _query)
                        <span style="color: #F0DFAF; font-weight: bold;">case</span> <span style="color: #CC9393;">"getmore"</span>:
                                query = fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"%v.getmore"</span>, ns)
                        <span style="color: #F0DFAF; font-weight: bold;">case</span> <span style="color: #CC9393;">"command"</span>:
                                query = fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"%v({%v})"</span>, ns, info[<span style="color: #CC9393;">"command"</span>])
                        <span style="color: #F0DFAF; font-weight: bold;">default</span>:
                                query = fmt.<span style="color: #93E0E3;">Sprintf</span>(<span style="color: #CC9393;">"__UNIMPLEMENTED__ {%v};"</span>, _query)
                        }
                }
                fmt.<span style="color: #93E0E3;">Print</span>(<span style="color: #93E0E3;">getSlowQueryLogHeader</span>(info), query, <span style="color: #CC9393;">"\n"</span>)
        }

}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Fernando Ipar</p>
<p class="date">Created: 2015-06-23 Tue 16:03</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.51.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>